In [2]:
import pandas as pd

In [3]:
bg_weather_df = pd.DataFrame({
  "town": ["Sofia", "Sandanski", "Pleven"],
  "temp":[25,32,21],
  "rain": [False, False, True ]
})
bg_weather_df

        town  temp   rain
0      Sofia    25  False
1  Sandanski    32  False
2     Pleven    21   True

In [4]:
eu_weather_df = pd.DataFrame({
  "town": ["Atina", "Oslo", "London"],
  "temp":[35,21,25],
  "rain": [False, False, True ]
})
eu_weather_df

     town  temp   rain
0   Atina    35  False
1    Oslo    21  False
2  London    25   True

In [5]:
wind = [10, 20, 30]

eu_weather_df.insert(1,'wind',wind)
eu_weather_df

     town  wind  temp   rain
0   Atina    10    35  False
1    Oslo    20    21  False
2  London    30    25   True

In [6]:
# del eu_weather_df['wind']

wind = eu_weather_df.pop('wind')
wind

0    10
1    20
2    30
Name: wind, dtype: int64

In [7]:
eu_weather_df

     town  temp   rain
0   Atina    35  False
1    Oslo    21  False
2  London    25   True

In [8]:
eu_weather_df.drop(labels=1)

     town  temp   rain
0   Atina    35  False
2  London    25   True

In [9]:
eu_weather_df.drop(columns='temp')

     town   rain
0   Atina  False
1    Oslo  False
2  London   True

In [10]:
eu_weather_df.drop('temp', axis=1)

     town   rain
0   Atina  False
1    Oslo  False
2  London   True

In [11]:
eu_weather_df.drop(1, axis=0)

     town  temp   rain
0   Atina    35  False
2  London    25   True

In [12]:
eu_weather_df

     town  temp   rain
0   Atina    35  False
1    Oslo    21  False
2  London    25   True

In [13]:
new_row_data = ['Paris', 28, True]# 
# eu_weather_df.append(new_row_data, ignore_index=True)

In [14]:
eu_weather_df

     town  temp   rain
0   Atina    35  False
1    Oslo    21  False
2  London    25   True

In [15]:
new_row_data = pd.DataFrame({
	'town':['Paris'],
	'temp':[28],
	'rain':[True]
})
new_row_data

    town  temp  rain
0  Paris    28  True

In [16]:
pd.concat([eu_weather_df, new_row_data], axis=0, ignore_index=True)

     town  temp   rain
0   Atina    35  False
1    Oslo    21  False
2  London    25   True
3   Paris    28   True

In [17]:
wind = pd.DataFrame({
	'wind':[10,20,30]
}, index=[0,1,2])
wind

   wind
0    10
1    20
2    30

In [18]:
eu_weather_df

     town  temp   rain
0   Atina    35  False
1    Oslo    21  False
2  London    25   True

In [19]:
pd.concat([eu_weather_df,wind],axis=1)

     town  temp   rain  wind
0   Atina    35  False    10
1    Oslo    21  False    20
2  London    25   True    30